app/controllers/pins_controller.rb

 def index
    @pins = Pin.order("created_at desc").page(params[:page]).per_page(20)
---
SELECT "pins".* FROM "pins" ORDER BY created_at desc LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "pins"

  def edit
    @pin = current_user.pins.find(params[:id])
---
SELECT "pins".* FROM "pins" WHERE "pins"."user_id" = ? AND "pins"."id" = ? LIMIT 1  [["user_id", 2], ["id", "17"]]

  def create
    @pin = current_user.pins.new (params[:pin])

    if @pin.save
---
INSERT INTO "pins" ("created_at", "description", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Sat, 17 Aug 2013 15:27:27 UTC +00:00], ["description", "this is sweet!"], ["updated_at", Sat, 17 Aug 2013 15:27:27 UTC +00:00], ["user_id", 2]]

  def update
    @pin = current_user.pins.find(params[:id])
---
SELECT "pins".* FROM "pins" WHERE "pins"."user_id" = ? AND "pins"."id" = ? LIMIT 1  [["user_id", 2], ["id", "17"]]

  def destroy
    @pin = current_user.pins.find(params[:id])
    @pin.destroy
---
SELECT "pins".* FROM "pins" WHERE "pins"."user_id" = ? AND "pins"."id" = ? LIMIT 1  [["user_id", 2], ["id", "15"]]
DELETE FROM "pins" WHERE "pins"."id" = ?  [["id", 1]]